bin/Crunchify-JMeter-Test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.8" jmeter="2.13 r1665067">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="App Shah Desktop Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Crunchify&apos;s REST Service JMeter Test" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <longProp name="ThreadGroup.start_time">1367432020000</longProp>
        <longProp name="ThreadGroup.end_time">1367432020000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">User-Agent</stringProp>
              <stringProp name="Header.value">Mozilla/4.0 (compatible; MSIE 5.5; Windows 98)</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">[{&#xd;
    &quot;type&quot;:&quot;N&quot;,&#xd;
    &quot;bulk_id&quot;:&quot;0&quot;,&#xd;
    &quot;bulk_qty&quot;:&quot;0&quot;,&#xd;
    &quot;staging&quot;:false,&#xd;
    &quot;shipper_id&quot;:&quot;1&quot;,&#xd;
    &quot;shipper_type&quot;:&quot;N&quot;,&#xd;
    &quot;shipper_ref_no&quot;:&quot;300513412&quot;,&#xd;
    &quot;shipper_prefix&quot;:&quot;NV-SG101RIW-&quot;,&#xd;
    &quot;customer_ref_no&quot;:1,&#xd;
    &quot;instruction&quot;:null,&#xd;
    &quot;max_delivery_days&quot;:0,&#xd;
    &quot;pp_date&quot;:&quot;2015-04-09&quot;,&#xd;
    &quot;pp_timewindow_id&quot;:&quot;3&quot;,&#xd;
    &quot;dd_date&quot;:&quot;2015-04-09&quot;,&#xd;
    &quot;dd_timewindow_id&quot;:-1,&#xd;
    &quot;pickup_reach_by&quot;:null,&#xd;
    &quot;delivery_reach_by&quot;:null,&#xd;
    &quot;goods_amount&quot;:&quot;0&quot;,&#xd;
    &quot;parcels&quot;:[&#xd;
        {&#xd;
            &quot;parcel_size_id&quot;:3,&#xd;
            &quot;weight&quot;:1,&#xd;
            &quot;volume&quot;:1,&#xd;
			&quot;dimensions&quot;:&quot;aaaa&quot;,&#xd;
			&quot;goods_value&quot;:25.00,&#xd;
			&quot;goods_description&quot;:&quot;goods value 25.00&quot;,&#xd;
            &quot;async_handle&quot;:&quot;7026c219-547f-e4e6-1ae3-fed3c955SAA1&quot;&#xd;
        },&#xd;
        {&#xd;
            &quot;parcel_size_id&quot;:3,&#xd;
            &quot;weight&quot;:1,&#xd;
            &quot;volume&quot;:1,&#xd;
			&quot;dimensions&quot;:&quot;bbbb&quot;,&#xd;
			&quot;goods_value&quot;:35.00,&#xd;
			&quot;goods_description&quot;:&quot;goods value 25.00&quot;,&#xd;
            &quot;async_handle&quot;:&quot;7026c219-547f-e4e6-1ae3-fed3c955SAA1&quot;&#xd;
        },{&#xd;
            &quot;parcel_size_id&quot;:3,&#xd;
            &quot;weight&quot;:1,&#xd;
            &quot;volume&quot;:1,&#xd;
			&quot;dimensions&quot;:&quot;cccc&quot;,&#xd;
			&quot;goods_value&quot;:45.00,&#xd;
			&quot;goods_description&quot;:&quot;goods value 25.00&quot;,&#xd;
            &quot;async_handle&quot;:&quot;7026c219-547f-e4e6-1ae3-fed3c955SAA1&quot;&#xd;
        }&#xd;
    ],&#xd;
    &quot;from_postcode&quot;:&quot;470762&quot;,&#xd;
    &quot;to_postcode&quot;:&quot;079212&quot;,&#xd;
    &quot;from_city&quot;:&quot;SG&quot;,&#xd;
    &quot;to_city&quot;:&quot;SG&quot;,&#xd;
    &quot;from_country&quot;:&quot;SG&quot;,&#xd;
    &quot;to_country&quot;:&quot;SG&quot;,&#xd;
    &quot;from_address1&quot;:&quot;BLOCK 762 BEDOK RESERVOIR VIEW&quot;,&#xd;
    &quot;to_address1&quot;:&quot;#06-08 PODIUM B&quot;,&#xd;
    &quot;from_address2&quot;:&quot;10-313&quot;,&#xd;
    &quot;to_address2&quot;:&quot;&quot;,&#xd;
    &quot;from_name&quot;:&quot;Mybeautystory&quot;,&#xd;
    &quot;to_name&quot;:&quot;Lu Feng&quot;,&#xd;
    &quot;from_contact&quot;:&quot;96966559&quot;,&#xd;
    &quot;to_contact&quot;:&quot;81267898&quot;,&#xd;
    &quot;from_email&quot;:&quot;mybeautystory@hotmail.sg&quot;,&#xd;
    &quot;to_email&quot;:&quot;support@ninjavan.sg&quot;,&#xd;
	&quot;to_state&quot;:&quot;Singapore&quot;,&#xd;
	&quot;from_state&quot;:&quot;Singapore&quot;,&#xd;
	&quot;from_lat&quot;:0,&#xd;
	&quot;from_lng&quot;:0,&#xd;
	&quot;to_lat&quot;:0,&#xd;
	&quot;to_lng&quot;:0,&#xd;
	&quot;fulfillment_details&quot;:&quot;fffffffffffffffffff&quot;&#xd;
&#xd;
}]</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">52.76.54.44</stringProp>
          <stringProp name="HTTPSampler.port">9000</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.path">/payload</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>